# Machine Learning On House Price Data to Predict House Price

We are going to perform the modelling on house price dataset, in this we have multiple parameters who can help us to predict the price of that specific house.

## Import the required library

In [ ]:
# import numerical python
import numpy as np

# import the pandas
import pandas as pd

# import the seaborn
import seaborn as sns

# import the matplotlib
import matplotlib.pyplot as plt

### Data Overview

In [ ]:
# Load the data
df_house_price=pd.read_csv('House_Price1.csv')

In [ ]:
# Show the first five observations of the data
df_house_price.head()

,price,resid_area,air_qual,room_num,age,distance,teachers,poor_prop,airport,n_hos_beds,n_hot_rooms,waterbody,rainfall,bus_ter,Sold
0,24.0,32.31,0.538,6.575,65.2,4.35,24.7,4.98,YES,5.480,11.1920,River,23,YES,0
1,21.6,37.07,0.469,6.421,78.9,4.99,22.2,9.14,NO,7.332,12.1728,Lake,42,YES,1
2,34.7,37.07,0.469,7.185,61.1,5.03,22.2,4.03,NO,7.394,101.1200,NaN,38,YES,0
3,33.4,32.18,0.458,6.998,45.8,6.21,21.3,2.94,YES,9.268,11.2672,Lake,45,YES,0
4,36.2,32.18,0.458,7.147,54.2,6.16,21.3,5.33,NO,8.824,11.2896,Lake,55,YES,0

In [ ]:
# Show the last five observations of the data
df_house_price.tail()

,price,resid_area,air_qual,room_num,age,distance,teachers,poor_prop,airport,n_hos_beds,n_hot_rooms,waterbody,rainfall,bus_ter,Sold
501,22.4,41.93,0.573,6.593,69.1,2.64,19.0,9.67,NO,9.348,12.1792,Lake and River,27,YES,1
502,20.6,41.93,0.573,6.120,76.7,2.44,19.0,9.08,YES,6.612,13.1648,Lake and River,20,YES,1
503,23.9,41.93,0.573,6.976,91.0,2.34,19.0,5.64,NO,5.478,12.1912,NaN,31,YES,1
504,22.0,41.93,0.573,6.794,89.3,2.54,19.0,6.48,YES,7.940,15.1760,NaN,47,YES,1
505,19.0,41.93,0.573,6.030,80.8,2.72,19.0,7.88,YES,10.280,10.1520,NaN,45,YES,1

In [ ]:
# Show the shape of the data
df_house_price.shape

(506, 15)

In [ ]:
# Show the basic statistics of the data
df_house_price.describe()

,price,resid_area,air_qual,room_num,age,distance,teachers,poor_prop,n_hos_beds,n_hot_rooms,rainfall,Sold
count,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,498.000000,506.000000,506.000000,506.000000
mean,22.528854,41.136779,0.554695,6.284634,68.574901,3.971996,21.544466,12.653063,7.899767,13.041605,39.181818,0.454545
std,9.182176,6.860353,0.115878,0.702617,28.148861,2.108532,2.164946,7.141062,1.476683,5.238957,12.513697,0.498422
min,5.000000,30.460000,0.385000,3.561000,2.900000,1.130000,18.000000,1.730000,5.268000,10.057600,3.000000,0.000000
25%,17.025000,35.190000,0.449000,5.885500,45.025000,2.270000,19.800000,6.950000,6.634500,11.189800,28.000000,0.000000
50%,21.200000,39.690000,0.538000,6.208500,77.500000,3.385000,20.950000,11.360000,7.999000,12.720000,39.000000,0.000000
75%,25.000000,48.100000,0.624000,6.623500,94.075000,5.367500,22.600000,16.955000,9.088000,14.170800,50.000000,1.000000
max,50.000000,57.740000,0.871000,8.780000,100.000000,12.320000,27.400000,37.970000,10.876000,101.120000,60.000000,1.000000

In [ ]:
# Show the basic informations of the data
df_house_price.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 506 entries, 0 to 505
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   price        506 non-null    float64
 1   resid_area   506 non-null    float64
 2   air_qual     506 non-null    float64
 3   room_num     506 non-null    float64
 4   age          506 non-null    float64
 5   distance     506 non-null    float64
 6   teachers     506 non-null    float64
 7   poor_prop    506 non-null    float64
 8   airport      506 non-null    object
 9   n_hos_beds   498 non-null    float64
 10  n_hot_rooms  506 non-null    float64
 11  waterbody    351 non-null    object
 12  rainfall     506 non-null    int64
 13  bus_ter      506 non-null    object
 14  Sold         506 non-null    int64
dtypes: float64(10), int64(2), object(3)
memory usage: 59.4+ KB

# Interpretation

 - we have 506 observations and 15 attributes
 - we have age column which contain the outlier

## Data Pre-Processing

In [ ]:
# lets perform the data cleaning
df_house_price.columns

Index(['price', 'resid_area', 'air_qual', 'room_num', 'age', 'distance',
       'teachers', 'poor_prop', 'airport', 'n_hos_beds', 'n_hot_rooms',
       'waterbody', 'rainfall', 'bus_ter', 'Sold'],
      dtype='object')

In [ ]:
dictionary={
    'price':'Price',
    'resid_area':'Residential_Area',
    'air_qual':'Air_Quality',
    'room_num':'Room_Number',
    'age':'Age',
    'distance':'Distance',
    'teachers':'Teachers',
    'poor_prop':'Poor_Property',
    'airport':'Airport',
    'n_hos_beds':'N_Hospital_Beds',
    'n_hot_rooms':'N_Hotel_Rooms',
    'waterbody':'Waterbody',
    'rainfall':'Rainfall',
    'bus_ter':'Bus_Ter',
    'Sold':'Sold'
}

In [ ]:
# perform the rename action
df_house_price = df_house_price.rename(columns=dictionary)

In [ ]:
# Do the authentic check
df_house_price.columns

Index(['Price', 'Residential_Area', 'Air_Quality', 'Room_Number', 'Age',
       'Distance', 'Teachers', 'Poor_Property', 'Airport', 'N_Hospital_Beds',
       'N_Hotel_Rooms', 'Waterbody', 'Rainfall', 'Bus_Ter', 'Sold'],
      dtype='object')

### Null value Handling

In [ ]:
# Find the Number of missing records
df_house_price.isnull().sum()

Price                 0
Residential_Area      0
Air_Quality           0
Room_Number           0
Age                   0
Distance              0
Teachers              0
Poor_Property         0
Airport               0
N_Hospital_Beds       8
N_Hotel_Rooms         0
Waterbody           155
Rainfall              0
Bus_Ter               0
Sold                  0
dtype: int64

In [ ]:
# Find the percentage
df_house_price.isnull().sum()/len(df_house_price)*100

Price                0.000000
Residential_Area     0.000000
Air_Quality          0.000000
Room_Number          0.000000
Age                  0.000000
Distance             0.000000
Teachers             0.000000
Poor_Property        0.000000
Airport              0.000000
N_Hospital_Beds      1.581028
N_Hotel_Rooms        0.000000
Waterbody           30.632411
Rainfall             0.000000
Bus_Ter              0.000000
Sold                 0.000000
dtype: float64

In [ ]:
# Find the mode of waterbody column
df_house_price.Waterbody.mode()

0    River
Name: Waterbody, dtype: object

In [ ]:
# lets treat the null values in waterbody column
df_house_price.Waterbody.fillna('River',inplace = True)

In [ ]:
# Do the authentic check
df_house_price.isnull().sum()

Price               0
Residential_Area    0
Air_Quality         0
Room_Number         0
Age                 0
Distance            0
Teachers            0
Poor_Property       0
Airport             0
N_Hospital_Beds     8
N_Hotel_Rooms       0
Waterbody           0
Rainfall            0
Bus_Ter             0
Sold                0
dtype: int64

In [ ]:
# In N_Hospital_Beds, we have less than 10% of data is missing
df_house_price.dropna(inplace=True)

In [ ]:
# Do the authentic check
df_house_price.isnull().sum()

Price               0
Residential_Area    0
Air_Quality         0
Room_Number         0
Age                 0
Distance            0
Teachers            0
Poor_Property       0
Airport             0
N_Hospital_Beds     0
N_Hotel_Rooms       0
Waterbody           0
Rainfall            0
Bus_Ter             0
Sold                0
dtype: int64

In [ ]:
# store the target variable 'Chance of Admit' in a dataframe 'df_target'
df_target = df_house_price['Price']

# store all the independent variables in a dataframe 'df_feature'
# drop the column 'Chance of Admit' using drop()
# 'axis = 1' drops the specified column
df_feature = df_house_price.drop('Price', axis = 1)

In [ ]:
# Segregate the data based on the datatype
df_num = df_house_price.select_dtypes(include='number')
df_cat = df_house_price.select_dtypes(include='object')

In [ ]:
# Show the Numerical data
df_num.head()

,Price,Residential_Area,Air_Quality,Room_Number,Age,Distance,Teachers,Poor_Property,N_Hospital_Beds,N_Hotel_Rooms,Rainfall,Sold
0,24.0,32.31,0.538,6.575,65.2,4.35,24.7,4.98,5.480,11.1920,23,0
1,21.6,37.07,0.469,6.421,78.9,4.99,22.2,9.14,7.332,12.1728,42,1
2,34.7,37.07,0.469,7.185,61.1,5.03,22.2,4.03,7.394,101.1200,38,0
3,33.4,32.18,0.458,6.998,45.8,6.21,21.3,2.94,9.268,11.2672,45,0
4,36.2,32.18,0.458,7.147,54.2,6.16,21.3,5.33,8.824,11.2896,55,0

In [ ]:
# Show the categorical data
df_cat.head()

  Airport Waterbody Bus_Ter
0     YES     River     YES
1      NO      Lake     YES
2      NO     River     YES
3     YES      Lake     YES
4      NO      Lake     YES

### Perform Encoding on categorical variable

In [ ]:
# Use Dummy encoding
df_encoded = pd.get_dummies(df_cat)
# Reset the index
df_encoded = df_encoded.reset_index()

In [ ]:
# Show the encoded data
df_encoded.head()

,index,Airport_NO,Airport_YES,Waterbody_Lake,Waterbody_Lake and River,Waterbody_River,Bus_Ter_YES
0,0,False,True,False,False,True,True
1,1,True,False,True,False,False,True
2,2,True,False,False,False,True,True
3,3,False,True,True,False,False,True
4,4,True,False,True,False,False,True

### Perform Scaling on Numerical data

In [ ]:
# import the standard scaler
from sklearn.preprocessing import StandardScaler

# initiate the standard scaler
ss = StandardScaler()

In [ ]:
# Scaled the value present in Numerical dataframe
scaled = ss.fit_transform(df_num)

In [ ]:
scaled

array([[ 0.15479189, -1.28244435, -0.13709359, ..., -0.35211111,
        -1.30206786, -0.91152748],
       [-0.10659165, -0.59005882, -0.73319492, ..., -0.16601943,
         0.21519397,  1.09705963],
       [ 1.32012686, -0.59005882, -0.73319492, ..., 16.71034024,
        -0.10422957, -0.91152748],
       ...,
       [ 0.14390091,  0.11687263,  0.16527665, ..., -0.16252832,
        -0.66322077,  1.09705963],
       [-0.06302773,  0.11687263,  0.16527665, ...,  0.40379146,
         0.6144734 ,  1.09705963],
       [-0.38975716,  0.11687263,  0.16527665, ..., -0.54943507,
         0.45476163,  1.09705963]])

In [ ]:
# Numerate the data into the dataframe
scaled_df = pd.DataFrame(scaled,columns=df_num.columns)

In [ ]:
# Reset the Index
scaled_df = scaled_df.reset_index()

In [ ]:
# Show the data
scaled_df.head()

,level_0,index,Price,Residential_Area,Air_Quality,Room_Number,Age,Distance,Teachers,Poor_Property,N_Hospital_Beds,N_Hotel_Rooms,Rainfall,Sold
0,0,0,0.154792,-1.282444,-0.137094,0.408975,-0.115644,0.172845,1.462167,-1.066368,-1.640299,-0.352111,-1.302068,-0.911527
1,1,1,-0.106592,-0.590059,-0.733195,0.189974,0.369741,0.476100,0.304963,-0.484136,-0.384875,-0.166019,0.215194,1.097060
2,2,2,1.320127,-0.590059,-0.733195,1.276446,-0.260905,0.495053,0.304963,-1.199330,-0.342847,16.710340,-0.104230,-0.911527
3,3,3,1.178544,-1.301354,-0.828226,1.010516,-0.802977,1.054179,-0.111631,-1.351886,0.927490,-0.337843,0.454762,-0.911527
4,4,4,1.483492,-1.301354,-0.828226,1.222407,-0.505369,1.030487,-0.111631,-1.017382,0.626514,-0.333593,1.253320,-0.911527

### Perform the Concatenate operation

In [ ]:
# concat encoded variable and scaled variable
df_independent = pd.concat([df_encoded,scaled_df],axis=1)

In [ ]:
# Show the data
df_independent.head()

,index,Airport_NO,Airport_YES,Waterbody_Lake,Waterbody_Lake and River,Waterbody_River,Bus_Ter_YES,level_0,index,Price,...,Air_Quality,Room_Number,Age,Distance,Teachers,Poor_Property,N_Hospital_Beds,N_Hotel_Rooms,Rainfall,Sold
0,0,False,True,False,False,True,True,0,0,0.154792,...,-0.137094,0.408975,-0.115644,0.172845,1.462167,-1.066368,-1.640299,-0.352111,-1.302068,-0.911527
1,1,True,False,True,False,False,True,1,1,-0.106592,...,-0.733195,0.189974,0.369741,0.476100,0.304963,-0.484136,-0.384875,-0.166019,0.215194,1.097060
2,2,True,False,False,False,True,True,2,2,1.320127,...,-0.733195,1.276446,-0.260905,0.495053,0.304963,-1.199330,-0.342847,16.710340,-0.104230,-0.911527
3,3,False,True,True,False,False,True,3,3,1.178544,...,-0.828226,1.010516,-0.802977,1.054179,-0.111631,-1.351886,0.927490,-0.337843,0.454762,-0.911527
4,4,True,False,True,False,False,True,4,4,1.483492,...,-0.828226,1.222407,-0.505369,1.030487,-0.111631,-1.017382,0.626514,-0.333593,1.253320,-0.911527

## Split the data for training and testing

In [ ]:
# import the train test split
from sklearn.model_selection import train_test_split

In [ ]:
# split the data
x_train,x_test,y_train,y_test=train_test_split(df_independent,
                                              df_target,
                                              test_size=0.2)

In [ ]:
#check the size
x_train.shape

(398, 21)

In [ ]:
x_test.shape

(100, 21)

In [ ]:
y_train.shape

(398,)

In [ ]:
y_test.shape

(100,)

# Apply Linear Regression

In [ ]:
# import the model
from sklearn.linear_model import LinearRegression
from sklearn.metrics import mean_squared_error

In [ ]:
# initiate the model
LR=LinearRegression()

In [ ]:
# train the linear regression model
model_lr=LR.fit(x_train,y_train)

In [ ]:
# perform the prediction
predicted=model_lr.predict(x_test)

In [ ]:
# show the predicted values
predicted

array([18.7, 30.1, 36.5,  7.2, 20.3, 22. ,  7.2, 23.7, 43.8, 22.2, 13.1,
       21.4, 20.6, 23.2, 48.5, 19.9, 23.9, 15.6, 25.3, 22. , 25.1, 24. ,
       15.2, 24.5, 36. , 42.3, 21.4, 21.5, 24.8, 23.7, 24.4, 20.5, 20. ,
       50. , 21.7, 32.2, 19. , 10.4, 24.3, 20.7, 24.3, 29.4, 21.7, 14.8,
       20.9, 20. , 28.5, 21.9, 19.5, 20.4, 30.8, 13.5, 31.1, 13. , 23. ,
       21.1, 19.9, 25.2, 23.6, 14.6, 16.4, 27. , 13.4, 13.9, 19.5, 23.3,
       17.4, 11.7, 13.1, 18.4, 27.9, 12.6,  8.1, 17.1, 21.9, 20.6, 15. ,
       16.5, 10.5, 19.3, 13.3, 13.6, 27.1, 18. , 14.8, 16.3, 14.9, 34.9,
       32. , 46.7, 22.2,  5. , 13.9, 16. ,  8.3, 29.1, 17.6, 19.4, 18.3,
       23.4])

In [ ]:
y_test

60     18.7
223    30.1
264    36.5
415     7.2
297    20.3
       ...
278    29.1
244    17.6
153    19.4
497    18.3
73     23.4
Name: Price, Length: 100, dtype: float64

In [ ]:
# evaluate the model
round(mean_squared_error(predicted,y_test),3)

0.0